src/InformationRegisters/кфкВходящиеСообщения/кфкВходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкВходящиеСообщения</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.кфкСтатусыСообщений</types>
    </type>
  </resources>
  <resources>
    <name>Заголовки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ТелоСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Консьюмер</name>
    <type>
      <types>CatalogRef.кфкКонсьюмеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Топик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Раздел</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смещение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлОбработкиМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЖурнала</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаИзмененияМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>КлючЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗагрузкиМС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/кфкСтатусыСообщений/кфкСтатусыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>кфкСтатусыСообщений</name>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>Обработано</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаОтменена</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>Выгружено</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаВыгрузки</name>
  </enumValues>
</mdclass:Enum>

src/InformationRegisters/кфкВходящиеСообщения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Сбросить статус ошибки.
// 
// Параметры:
//  КлючиЗаписей - Массив Из РегистрСведенийКлючЗаписи.кфкВходящиеСообщения - Ключи записей
Процедура СброситьСтатусОшибки(КлючиЗаписей) Экспорт
	
	Очередь = кфкОбщегоНазначенияСлужебный.СоздатьНаборЗаписей(РегистрыСведений.кфкВходящиеСообщения); // РегистрСведенийНаборЗаписей.кфкВходящиеСообщения
	
	//@skip-check invocation-parameter-type-intersect
	Таблица = Очередь.Выгрузить(, "КлючЗаписи,ДатаЗагрузкиМС");
	
	Для Каждого КлючЗаписей Из КлючиЗаписей Цикл
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), КлючЗаписей);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.КлючЗаписи КАК КлючЗаписи,
	|	Т.ДатаЗагрузкиМС КАК ДатаЗагрузкиМС
	|ПОМЕСТИТЬ ВТКлючиЗаписей
	|ИЗ
	|	&Таблица КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВходящиеСообщения.КлючЗаписи КАК КлючЗаписи,
	|	ВходящиеСообщения.ДатаЗагрузкиМС КАК ДатаЗагрузкиМС,
	|	ВЫБОР
	|		КОГДА ВходящиеСообщения.Статус = ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаОбработки)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.Новое)
	|	КОНЕЦ КАК Статус,
	|	ВходящиеСообщения.Заголовки КАК Заголовки,
	|	ВходящиеСообщения.ТелоСообщения КАК ТелоСообщения,
	|	ВходящиеСообщения.Консьюмер КАК Консьюмер,
	|	ВходящиеСообщения.Топик КАК Топик,
	|	ВходящиеСообщения.Раздел КАК Раздел,
	|	ВходящиеСообщения.Смещение КАК Смещение,
	|	ВходящиеСообщения.КлючСообщения КАК КлючСообщения,
	|	ВходящиеСообщения.ДатаЗаписи КАК ДатаЗаписи,
	|	ВходящиеСообщения.ДатаЗагрузки КАК ДатаЗагрузки,
	|	ВходящиеСообщения.ДатаОбработки КАК ДатаОбработки,
	|	ВходящиеСообщения.ДлОбработкиМС КАК ДлОбработкиМС,
	|	ВходящиеСообщения.ТекстЖурнала КАК ТекстЖурнала,
	|	ВходящиеСообщения.МеткаИзмененияМС КАК МеткаИзмененияМС
	|ИЗ
	|	ВТКлючиЗаписей КАК ВТКлючиЗаписей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.кфкВходящиеСообщения КАК ВходящиеСообщения
	|		ПО ВТКлючиЗаписей.КлючЗаписи = ВходящиеСообщения.КлючЗаписи
	|		И ВТКлючиЗаписей.ДатаЗагрузкиМС = ВходящиеСообщения.ДатаЗагрузкиМС
	|ГДЕ
	|	ВходящиеСообщения.Статус = ЗНАЧЕНИЕ(Перечисление.кфкСтатусыСообщений.ОшибкаОбработки)";
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Очередь.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.МеткаИзмененияМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
	КонецЦикла;
	
	Очередь.Записать(РежимЗамещения.Обновление);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
